###########################################################################
#
# Generated by : Version 8.0 Build 231 07/10/2008 Service Pack 1 SJ Full Version
#
# Project      : top-2s30
# Revision     : top
#
# Date         : Wed Apr 27 14:17:24 China Standard Time 2011
#
###########################################################################
 
 
# WARNING: Expected ENABLE_CLOCK_LATENCY to be set to 'ON', but it is set to 'OFF'
#          In SDC, create_generated_clock auto-generates clock latency
#
# ------------------------------------------
#
# Create generated clocks based on PLLs
derive_pll_clocks -use_tan_name
#
# ------------------------------------------


# Original Clock Setting Name: clk_i
create_clock -period "8.000 ns" \
             -name {clk_i} {clk_i}
# ---------------------------------------------

# ** Clock Latency
#    -------------

# ** Clock Uncertainty
#    -----------------

# ** Multicycles
#    -----------
# ** Cuts
#    ----

# ** Input/Output Delays
#    -------------------
set_input_delay -clock { clk_i } -min 0 [get_ports {ssram0_dq_io*}]
set_input_delay -clock { clk_i } -max 3 [get_ports {ssram0_dq_io*}]


set_output_delay -clock { clk_i } -min -0.4 [get_ports {ssram0_dq_io*}]
set_output_delay -clock { clk_i } -max 1.4 [get_ports {ssram0_dq_io*}]

set_output_delay -clock { clk_i } -min -0.4 [get_ports {ssram0_addr_o*}]
set_output_delay -clock { clk_i } -max 1.4 [get_ports {ssram0_addr_o*}]

set_output_delay -clock { clk_i } -min -0.4 [get_ports {ssram0_we*}]
set_output_delay -clock { clk_i } -max 1.4 [get_ports {ssram0_we*}]
set_output_delay -clock { clk_i } -min -0.4 [get_ports {ssram0_oe*}]
set_output_delay -clock { clk_i } -max 1.4 [get_ports {ssram0_oe*}]
set_output_delay -clock { clk_i } -min -0.4 [get_ports {ssram0_ce*}]
set_output_delay -clock { clk_i } -max 1.4 [get_ports {ssram0_ce*}]
set_output_delay -clock { clk_i } -min -0.4 [get_ports {ssram0_cke*}]
set_output_delay -clock { clk_i } -max 1.4 [get_ports {ssram0_cke*}]
# ** Tpd requirements
#    ----------------

# ** Setup/Hold Relationships
#    ------------------------

# ** Tsu/Th requirements
#    -------------------


# ** Tco/MinTco requirements
#    -----------------------

#
# Entity Specific Timing Assignments found in
# the Timing Analyzer Settings report panel
#


# ---------------------------------------------

